

export class EnglishTextService {
  constructor() {
  }

  contactUsText = {
    contactUsHeadline: `نحن نحب أن نعرف المزيد عن مشاريعك وكيف يمكننا مساعدتك في تحقيق رؤيتك.`,
    contactUsSideText: `ثق بفريقنا ذو الخبرة العالية في مجال التكنولوجيا ومدالات التصميم ليكون شريكك الموثوق في تحويل أفكارك إلى واقع. قم بتعيننا كفريق تكنولوجي و تسويفي موثوق به واستفد من خبرتنا.`
  }

  workProcessText = `نحن فريق رشيق يجمع بين قوة التفكير التصميمي وأحدث التقنيات لتقديم حلول شاملة لتطوير المواقع الإلكترونية والعلامات التجارية والتصميم للشركات بجميع الأحجام. من صناعة صور جذابة إلى خلق تجارب مستخدم سلسة.`;

  readyToTalkToUsText = `هل أنت جاهز لتحويل أفكارك إلى واقع؟ نحن هنا للمساعدة. شاركنا مشروعك أو مشكلتك، ودعنا نقوم بإنشاء موقع ويب مذهل يعكس رؤيتك.`;

  hireUsAsTechTeam = `استفد من قوة فريقنا المتميز. مع وجود 5 مصممين ومطورين موهوبين في خدمتك، سنحقق مشروعك بخبرتنا وتعاوننا.`;

  aboutUsText = {
    aboutDivoxText: `في ديفوكس، رؤيتنا هي تمكين الشركات من خلال حلول رقمية متطورة تدفع النمو والنجاح. نحن فريق مكون من محترفين متحمسين ملتزمين بتقديم خدمات استثنائية في تصميم وتطوير المواقع الإلكترونية والعلامات التجارية.`,
    ourApproachText: `نحن نؤمن بقوة الابتكار والتعاون. يجمع فريقنا بين الخبرة التقنية الواسعة والتفكير الإبداعي لإبداع تجارب رقمية تترك أثرًا دائمًا. نسعى جاهدين لفهم أهداف عملك الفريدة وتصميم حلول مخصصة تتجاوز توقعاتك.`,
    collaborationAndResultsText: `في ديفوكس، نعطي الأولوية للتعاون والتواصل المفتوح. نعمل عن كثب مع عملائنا ونشملهم في كل مرحلة من عملية التطوير، بدءًا من التصور الأولي حتى التنفيذ النهائي. هدفنا هو تقديم نتائج ملموسة تتوافق مع أهدافك، ومساعدتك على تحقيق نمو مستدام في عالم رقمي متغير باستمرار.`,
    experienceTheDivoxDifferenceText: `اختر ديفوكس كشريكك الموثوق لجميع احتياجاتك الرقمية. دعنا نساعدك في التنقل في تعقيدات العالم الرقمي ونقدم لك الدعم والخبرة غير المسبوقة. انضم إلينا، ومعًا سنخلق تجارب رقمية تأسر الألباب وتلهمك، وتدفع عملك إلى الأمام.`
  }

  divoxSlogan = `من سحر التقنية إلى إتقان التسويق: ديفوكس تفعل كل شيء!`;

  whatIsDivox = `لسنا مجرد شركة تقنية عادية. في ديفوكس، نؤمن بقوة البساطة والتصميم الأنيق في تحويل كيفية حل التكنولوجيا للمشاكل. مهمتنا هي تحدي القواعد، وإعادة تصوّر الإمكانيات، وجعل الأفكار المعقدة سهلة الوصول وسهلة الاستخدام. من تطوير تطبيقات الويب الشاملة إلى تصميم العلامة التجارية الجذاب، نضفي الإبداع في كل حل نقدمه. انضم إلينا رحلة  الابتكار ودع ديفوكس يكون شريكك الإبداعي.`;

  whyDivox = `ديفوكس: حيث تحصل حلول التكنولوجيا على لمسة ساحرة من الابتكار! المكون السري؟ البساطة والتصميم الأنيق الذي يثير إعجاب المستخدمين. فريقنا من الخبراء التقنيين والمصممين سيوفر لك تجربة رائعة في كامل العملية، مع التأكد من أنك تكون جزءًا من السحر. قل وداعًا للملل ومرحبًا بديفوكس، حيث سيرى عملك النور نحو المستقبل!`;

  projectsCost = `تكلفة المشروع: هنا نقدم لك سعر مناسب وقيمة عالية `;

  servicesDescription = `هيكل التسعير الخاص بنا يعتمد على المشروع ويتطلب دفعة مقدمة للبدء في العمل. يتم إجراء المدفوعات بعد الانتهاء من كل مرحلة. فيما يلي تفاصيل لمجموعة خدماتنا المتنوعة:`;

  servicesText = {
    webAppText: `برمجة وتصميم المواقع الالكترونية و صفحات الويب <br> نقدم تصميم وبرمجة منكاملة لمواقع الويب بوساطة افضل مطورين المواقع و افضل المصممين`,
    landingPageText: ``,
    logoDesignText: `تصميم الشعارات <br> نمتلك اجود المصممين ذو خبرات عالية و ابداع لا محدود `,
    websiteText: ``,
    brandingText: `العلامة التجارية<br> نقدم دليل شامل لهوية العلامة التجارية، وتصميم الشعار، والرسومات المخصصة لأغراض التسويق.`,
    motionGraphicsVideos:`فيديوهات الرسوم المتحركة الديناميكية <br> اجذب عملائك بفيديوهات الرسوم المتحركة الديناميكية `,
    ContentCreator:`إنشاء المحتوى<br> منشئ المحتوى لدينا سيقوم بإنشاء كل المحتوى الذي تحتاجه لتعزيز مشروعك باللغة العربية`,
    marketingCampaigns:`حملات التسويق والاستشارات <br> قم بتعزيز عملك مع حملات تسويق قوية واستشارات من خبراء بالتسويق`,
    servicesNote: `يرجى ملاحظة أنه يمكن تقديم تفاصيل التسعير الخاصة بكل نوع من أنواع المشاريع بناءً على الاستشارة وفهم نطاق العمل المشمول.`,
    hireUsText: `قم بتعيننا كفريقك المثالي!`,
    readyToTalkToUs: `تواصل معنا لمعرفة المزيد حول كيفية تعيننا كفريقك!`,
  }

  ourTeam = {
    ourTeamText: `من هو فريقنا:`,
    productDesignerText: `مصمم منتجات <br>فريق مصممين واجهات المستخدم و تجربة المستخدم`,
    projectManagerText: `مدير مشروع<br> مدير مشروع ذو خبرة عالية في ادارة المشاريع`,
    frontendText: ` مهتدس برمجيات <br> فريق مهندسين  ذو خبرات عالية في تصميم كافة انواع المواقع الالكترونية`,
    graphicDesignerText: `مصمم جرافيكي <br> فريق مصممين جرافيكين لانتاج افضل التصاميم العصربة`,
  }


}
